In [1]:
import pandas as pd
import numpy as np

## 1. Construye una serie a partir del siguiente diccionario: 
``` python

d = {'Alex': 6353, 'Wilmer': 9487, 'Isabel': 2233}
```

In [7]:
serie_d = pd.Series({'Alex': 6353, 'Wilmer': 9487, 'Isabel': 2233})
serie_d

Alex      6353
Wilmer    9487
Isabel    2233
dtype: int64

## 2. Ahora, crea la misma serie, pero crealo directamente con estos indices (lee la documentación si es necesario):

```python
nombres = ['Wilmer', 'Lucas', 'Manu']

```

In [8]:
nombres = ['Wilmer', 'Lucas', 'Manu']
pd.Series(serie_d, index=nombres)

Wilmer    9487.0
Lucas        NaN
Manu         NaN
dtype: float64

Tras hacer el ejercicio, sale algo raro? Por qué?

## 3. Cuantos nulos hay en la serie anterior?

In [9]:
np.isnan(serie_d)

Alex      False
Wilmer    False
Isabel    False
dtype: bool

In [10]:
pd.isnull(serie_d).sum()

0

## 4. Cargar el archivo "titanic.csv" en un DataFrame y mostrar 5 filas aleatorias del conjunto de datos.

In [11]:
titanic_df = pd.read_csv('datasets/titanic.csv')
titanic_df.to_csv('datasets/titanic.csv', index=False)
titanic_df.sample(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
185,0,1,"Rood, Mr. Hugh Roscoe",male,NaN,0,0,113767,50.0,A32,S
615,1,2,"Herman, Miss. Alice",female,24.0,1,2,220845,65.0,NaN,S
170,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5,B19,S
15,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0,NaN,S
284,0,1,"Smith, Mr. Richard William",male,NaN,0,0,113056,26.0,A19,S

## 4a. Cuantas filas y columnas tiene el dataframe?

In [12]:
titanic_df.shape

(891, 11)

## 4.b Cuantos nulos hay en el dataframe?

In [13]:
pd.isna(titanic_df).sum().sum()

866

## 4.c Puedes mostrarme, con una sola línea, las estadísticas del dataframe? (media, numero de filas no vacías, desviación típica, etc)

In [14]:
titanic_df.describe().T

          count       mean        std   min      25%      50%   75%       max
Survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
Pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
Age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
SibSp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
Parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
Fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

## 4.d Selecciona las columnas de pasajeros, edades y sobrevivieron.

In [15]:
titanic_df[['Name','Age','Survived']]

                                                  Name   Age  Survived
0                              Braund, Mr. Owen Harris  22.0         0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
2                               Heikkinen, Miss. Laina  26.0         1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
4                             Allen, Mr. William Henry  35.0         0
..                                                 ...   ...       ...
886                              Montvila, Rev. Juozas  27.0         0
887                       Graham, Miss. Margaret Edith  19.0         1
888           Johnston, Miss. Catherine Helen "Carrie"   NaN         0
889                              Behr, Mr. Karl Howell  26.0         1
890                                Dooley, Mr. Patrick  32.0         0

[891 rows x 3 columns]

## 5. Calcular el número total de pasajeros en el Titanic.

In [16]:
titanic_df.Name.nunique()

891

## 6. Determinar la cantidad de pasajeros que sobrevivieron y los que no sobrevivieron.

In [12]:
num_sobre =titanic_df[(titanic_df.Survived == 1)].count()[['Survived']]
num_sobre

Survived    342
dtype: int64

In [87]:
num_no_sobre =titanic_df[(titanic_df.Survived == 0)].count()[['Survived']]
num_no_sobre

Survived    549
dtype: int64

In [14]:
sobrevivientes_titanic = titanic_df['Survived'].value_counts()
sobrevivientes_titanic

0    549
1    342
Name: Survived, dtype: int64

## 7. Calcular el porcentaje de pasajeros que sobrevivieron en el Titanic.

In [18]:
porce_sobre_titanic = round((titanic_df[(titanic_df.Survived == 1)].count()['Survived'] / titanic_df.Name.nunique()) *100,2)
porce_sobre_titanic

38.38

## 8. Encontrar la edad promedio de los pasajeros a bordo.

In [16]:
edad_prome = round(titanic_df['Age'].mean(),2)
edad_prome

29.7

## 9. Calcular la cantidad de hombres y mujeres que viajaban en el Titanic.

In [17]:
titanic_df.sample(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
171,0,3,"Rice, Master. Arthur",male,4.0,4,1,382652,29.1250,NaN,Q
751,1,3,"Moor, Master. Meier",male,6.0,0,1,392096,12.4750,E121,S
187,1,1,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.0,0,0,111428,26.5500,NaN,S
824,0,3,"Panula, Master. Urho Abraham",male,2.0,4,1,3101295,39.6875,NaN,S
611,0,3,"Jardin, Mr. Jose Neto",male,NaN,0,0,SOTON/O.Q. 3101305,7.0500,NaN,S

In [19]:
conteo_genero = titanic_df.Sex.value_counts()
conteo_genero

male      577
female    314
Name: Sex, dtype: int64

## 10. Obtener el nombre de la persona más joven a bordo del Titanic.

In [25]:
nombre_masjo = titanic_df[(titanic_df.Age == titanic_df.Age.min())] ['Name'].values[0] 
nombre_masjo

'Thomas, Master. Assad Alexander'

In [27]:
#solucion Victor
titanic_df[(titanic_df.Age == titanic_df.Age.min())]['Name'].values[0]

'Thomas, Master. Assad Alexander'

## 11. Calcular la tarifa promedio pagada por los pasajeros del Titanic.

In [31]:
titanic_df.Fare.mean()

32.204207968574636

## 12. Encontrar el número de pasajeros en cada clase (primera, segunda y tercera).

In [104]:
conteo_clase = titanic_df['Pclass'].value_counts()
conteo_clase

3    491
1    216
2    184
Name: Pclass, dtype: int64

## 13. Calcular la cantidad de pasajeros que viajaban solos en comparación con los que viajaban con familiares.

In [57]:
pasaje_solos = titanic_df[(titanic_df['SibSp'] == 0) & (titanic_df['Parch'] == 0)].shape[0]
pasaje_solos

537

## 14. Encontrar la edad promedio de los pasajeros que sobrevivieron y los que no sobrevivieron.

In [43]:
sobrevi_df = titanic_df[(titanic_df.Survived == 1)]
proedad_sobrevi_df = sobrevi_df.Age.mean()
proedad_sobrevi_df

28.343689655172415

In [45]:
no_sobrevi_df = titanic_df[(titanic_df.Survived == 0)]
proedad_no_sobrevi_df = no_sobrevi_df.Age.mean()
proedad_no_sobrevi_df

30.62617924528302

## 15. Obtener el número de sobrevivientes por clase de pasajero.

In [51]:
conteo_clase_sobre = sobrevi_df['Pclass'].value_counts()
conteo_clase_sobre

1    136
3    119
2     87
Name: Pclass, dtype: int64

## 16. Encontrar la tarifa más alta pagada por un pasajero a bordo.

In [38]:
titanic_df.Fare.max()

512.3292

## 17. Calcular la cantidad de pasajeros que tenían hermanos o cónyuges a bordo.

In [49]:
titanic_df.sample(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
680,0,3,"Peters, Miss. Katie",female,NaN,0,0,330935,8.1375,NaN,Q
454,0,3,"Peduzzi, Mr. Joseph",male,NaN,0,0,A/5 2817,8.0500,NaN,S
554,1,3,"Ohman, Miss. Velin",female,22.0,0,0,347085,7.7750,NaN,S
126,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN,Q
116,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

In [29]:
pasaje_solos = titanic_df[(titanic_df['SibSp'] != 0)].shape[0]
pasaje_solos

283


## 18. Determinar la cantidad de pasajeros que embarcaron en cada puerto (Cherburgo, Queenstown y Southampton).

In [30]:
pasaje_puerto = titanic_df.Embarked.value_counts()
pasaje_puerto

S    644
C    168
Q     77
Name: Embarked, dtype: int64

## 19. Crea una copia del dataframe. A partir de ahora, trabajaras con esa copia.

In [35]:
titanic_df2 = titanic_df.copy()

## 20.Crea una columna que sea el doble de la tarifa.

In [36]:
titanic_df2['doble_tarifa'] = titanic_df2['Fare'] *2 
titanic_df2

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,doble_tarifa
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,14.5000
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,142.5666
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,15.8500
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,106.2000
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,16.1000
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,26.0000
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,60.0000
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,46.9000
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,60.0000
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,15.5000

## 21. Crea una columna que te coja la primera palabra después de la coma del nombre. Hazlo de forma directa y también con apply

### Apply

In [37]:
def prim_pal(cadena):
    primera = cadena.split()[1]
    segunda = primera.split()[0]
    return (segunda)

In [38]:
frase = 'Luke, yo soy tu padre'
prim_pal(frase)

'yo'

In [39]:
titanic_df2["primera_pal"] = titanic_df2.Name.apply(prim_pal)
titanic_df2

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,doble_tarifa,primera_pal
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,14.5000,Mr.
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,142.5666,Mrs.
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,15.8500,Miss.
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,106.2000,Mrs.
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,16.1000,Mr.
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,26.0000,Rev.
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,60.0000,Miss.
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,46.9000,Miss.
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,60.0000,Mr.
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,15.5000,Mr.

In [40]:
titanic_df2[['Name','primera_pal']]

                                                  Name primera_pal
0                              Braund, Mr. Owen Harris         Mr.
1    Cumings, Mrs. John Bradley (Florence Briggs Th...        Mrs.
2                               Heikkinen, Miss. Laina       Miss.
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)        Mrs.
4                             Allen, Mr. William Henry         Mr.
..                                                 ...         ...
886                              Montvila, Rev. Juozas        Rev.
887                       Graham, Miss. Margaret Edith       Miss.
888           Johnston, Miss. Catherine Helen "Carrie"       Miss.
889                              Behr, Mr. Karl Howell         Mr.
890                                Dooley, Mr. Patrick         Mr.

[891 rows x 2 columns]

In [116]:
titanic_df2.Name.apply(lambda nombre: nombre.split()[1])

0        Mr.
1       Mrs.
2      Miss.
3       Mrs.
4        Mr.
       ...
886     Rev.
887    Miss.
888    Miss.
889      Mr.
890      Mr.
Name: Name, Length: 891, dtype: object

## 22. Elimina las columnas de nombre y de tarifa.

In [101]:
titanic_df2.drop(columns=["Name","Fare"], inplace=False)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Cabin,Embarked,doble_tarifa,primera_pal
0,0,3,male,22.0,1,0,A/5 21171,NaN,S,14.5000,Mr.
1,1,1,female,38.0,1,0,PC 17599,C85,C,142.5666,Mrs.
2,1,3,female,26.0,0,0,STON/O2. 3101282,NaN,S,15.8500,Miss.
3,1,1,female,35.0,1,0,113803,C123,S,106.2000,Mrs.
4,0,3,male,35.0,0,0,373450,NaN,S,16.1000,Mr.
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,NaN,S,26.0000,Rev.
887,1,1,female,19.0,0,0,112053,B42,S,60.0000,Miss.
888,0,3,female,NaN,1,2,W./C. 6607,NaN,S,46.9000,Miss.
889,1,1,male,26.0,0,0,111369,C148,C,60.0000,Mr.
890,0,3,male,32.0,0,0,370376,NaN,Q,15.5000,Mr.

## 23.Dame los valores únicos de la columna creada en el 21

In [102]:
valores_unicos = titanic_df2['primera_pal'].value_counts()
valores_unicos

Mr.             502
Miss.           179
Mrs.            121
Master.          40
Dr.               7
Rev.              6
y                 4
Planke,           3
Impe,             3
Gordon,           2
Col.              2
Mlle.             2
Major.            2
Melkebeke,        1
Jonkheer.         1
Shawah,           1
the               1
Velde,            1
Capt.             1
Messemaeker,      1
Carlo,            1
Ms.               1
Mme.              1
Steen,            1
Mulder,           1
Pelsmaeker,       1
Walle,            1
der               1
Billiard,         1
Don.              1
Cruyssen,         1
Name: primera_pal, dtype: int64

## 24. Cambia el nombre de la columna Survived a: Sobrevivió.

In [67]:
titanic_df2.rename(columns={ 'Survived': 'Sobrevivio' })

,Sobrevivio,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,doble_tarifa
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,14.5000
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,142.5666
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,15.8500
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,106.2000
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,16.1000
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,26.0000
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,60.0000
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,46.9000
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,60.0000
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,15.5000

## 25. Borra las filas 1, 32 y 48

In [71]:
titanic_df.drop([1,32,48],axis=0,inplace=False).head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

## 26. Creame un grafico de barras que muestre cuantas personas sobrevivieron y cuantas no en función de su sexo.

In [107]:
conteo_genero = titanic_df['Sex'].value_counts()
conteo_genero

male      577
female    314
Name: Sex, dtype: int64

In [106]:
num_sobre =titanic_df[(titanic_df.Survived == 1)].count()[['Survived']]
num_sobre

Survived    342
dtype: int64

In [108]:
num_no_sobre =titanic_df[(titanic_df.Survived == 0)].count()[['Survived']]
num_no_sobre

Survived    549
dtype: int64